# DBSQLExecuteNext

## Description
Moves the resultSet current pointer to the next entry.

```pascal
FUNCTION DBSQLExecuteNext(resultSetInst : LONGINT) : BOOLEAN;
```

```python

def vs.DBSQLExecuteNext(resultSetInst):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|resultSetInst|LONGINT||

## Version
Availability: from Vectorworks 2011
## Category
* ODBC